In [34]:
#1. Import Pandas and check its version.
import pandas as pd

In [35]:
pd.__version__

'2.3.3'

In [36]:
#2. Create a Series from a Python list [10, 20, 30, 40].
s = pd.Series([10, 20, 30, 40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [37]:
#3. 
dict =     {"Name": ["A", "B"], 
            "Age": [20, 22]}
df = pd.DataFrame(dict)

In [38]:
df

  Name  Age
0    A   20
1    B   22

In [39]:
#4. Read a CSV file using Pandas.
df = pd.read_csv("../Data/Marks1.csv")

In [40]:
df

        Name School  Marks
0      Rahul     NR     34
1   Abhishek    VPS     56
2      Sohit    CPV     56
3      Harsh    JPS     66
4      Akash     NR     44
5  Divyanshu    JPS     55
6    Prateek     NR     78
7   UditKant     NR     98
8      Ayush    GPS     90

In [41]:
#5. Display the first 5 rows of a DataFrame.
df.head()

       Name School  Marks
0     Rahul     NR     34
1  Abhishek    VPS     56
2     Sohit    CPV     56
3     Harsh    JPS     66
4     Akash     NR     44

In [42]:
#6. Display the last 3 rows.
df.tail(3)

       Name School  Marks
6   Prateek     NR     78
7  UditKant     NR     98
8     Ayush    GPS     90

In [43]:
#7. Check: 1. shape 2. columns 3. data types
df.shape

(9, 3)

In [44]:
df.columns

Index(['Name', 'School', 'Marks'], dtype='object')

In [45]:
df.dtypes

Name      object
School    object
Marks      int64
dtype: object

In [46]:
#8. Rename a column.
df.rename(columns = {"School" : "Vidyalay"}, inplace = True)

In [47]:
df

        Name Vidyalay  Marks
0      Rahul       NR     34
1   Abhishek      VPS     56
2      Sohit      CPV     56
3      Harsh      JPS     66
4      Akash       NR     44
5  Divyanshu      JPS     55
6    Prateek       NR     78
7   UditKant       NR     98
8      Ayush      GPS     90

In [48]:
#9. Set a column as the index.
df.set_index("Name", inplace=True)

In [49]:
df

          Vidyalay  Marks
Name
Rahul           NR     34
Abhishek       VPS     56
Sohit          CPV     56
Harsh          JPS     66
Akash           NR     44
Divyanshu      JPS     55
Prateek         NR     78
UditKant        NR     98
Ayush          GPS     90

In [51]:
#10. Reset the index.
df.reset_index(inplace = True)

In [52]:
df

        Name Vidyalay  Marks
0      Rahul       NR     34
1   Abhishek      VPS     56
2      Sohit      CPV     56
3      Harsh      JPS     66
4      Akash       NR     44
5  Divyanshu      JPS     55
6    Prateek       NR     78
7   UditKant       NR     98
8      Ayush      GPS     90